In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("sample_with_nulls.csv")
df.head()

      Name   Age   Salary Department
0    Alice  25.0  50000.0         HR
1      Bob   NaN  60000.0         IT
2  Charlie  30.0      NaN    Finance
3    David  22.0  58000.0        NaN
4      Eva   NaN  62000.0  Marketing

In [3]:
df.isnull().sum()

Name          0
Age           4
Salary        2
Department    2
dtype: int64

In [4]:
#Handle missing values

df_cleaned = df.dropna()

In [6]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

In [8]:
df['Department'] = df['Department'].fillna(df['Department'].mode()[0])
#Use forward fill if required
#df = df.fillna(method = 'ffill')

In [9]:
df.isnull().sum()

Name          0
Age           0
Salary        0
Department    0
dtype: int64

In [10]:
df.head()

      Name   Age   Salary Department
0    Alice  25.0  50000.0         HR
1      Bob  27.5  60000.0         IT
2  Charlie  30.0  59062.5    Finance
3    David  22.0  58000.0    Finance
4      Eva  27.5  62000.0  Marketing

In [12]:
df.rename(columns = {'Salary': 'Salary (₹)'}, inplace = True)
df.columns

Index(['Name', 'Age', 'Salary (₹)', 'Department'], dtype='object')

In [14]:
df['Salary (₹)'] = df['Salary (₹)'].astype('str')
df.dtypes

Name           object
Age           float64
Salary (₹)     object
Department     object
dtype: object

In [15]:
df["Department"].value_counts()

Department
Finance      4
HR           2
IT           2
Marketing    2
Name: count, dtype: int64